In [119]:
import pandas as pd
import numpy as np
from sklearn.impute import SimpleImputer
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer
from sklearn.impute import KNNImputer
import seaborn as sns
import matplotlib.pyplot as plt
pd.set_option('display.max_columns', None)

Lectura de .csv limpios

In [120]:
data = pd.read_csv("../../files/HR_RAW_DATA.csv", index_col = 0)

employees = pd.read_csv("../../files/df_exploracion_employees.csv" , index_col = 0)

experience = pd.read_csv("../../files/df_employee_exp.csv")

surveys = pd.read_csv("../../files/surveys.csv" , index_col = 0)

employment = pd.read_csv("transofrmacion_patri" )

salary = pd.read_csv("../../files/salarydetails_w_floats.csv" , index_col = 0)

hours = pd.read_csv("../../files/df_Salary_SH.csv")

Concatenación de archivos

In [121]:
df_limpio = pd.concat([data['employeenumber'], employees, experience, surveys, employment, salary, hours], axis = 1, ignore_index = False)

Homogeneización de columnas

In [122]:
nuevas_columnas = {'employeenumber' : 'EmployeeID' , 'NUMBERCHILDREN' : 'NumberChildren' , 'NUMCOMPANIESWORKED' : 'NumCompaniesWorked', 'TOTALWORKINGYEARS' : 'TotalWorkingYears' , 'YEARSWITHCURRMANAGER' : 'YearsWithCurrManager' , 'WORKLIFEBALANCE' : 'WorkLifeBalance'}

In [123]:
df_limpio.rename(columns = nuevas_columnas, inplace = True)

In [124]:
df_limpio.columns

Index(['EmployeeID', 'Age', 'Gender', 'MaritalStatus', 'NumberChildren',
       'DateBirth', 'Over18', 'Education', 'EducationField',
       'NumCompaniesWorked', 'TotalWorkingYears', 'YearsAtCompany',
       'YearsInCurrentRole', 'YearsSinceLastPromotion', 'YearsWithCurrManager',
       'EnvironmentSatisfaction', 'JobSatisfaction',
       'RelationshipSatisfaction', 'WorkLifeBalance', 'JobInvolvement',
       'PerformanceRating', 'Attrition', 'OverTime', 'DistanceFromHome',
       'RemoteWork', 'BusinessTravel', 'TrainingTimesLastYear', 'Department',
       'JobRole', 'JobLevel', 'DailyRate', 'HourlyRate', 'MonthlyRate',
       'MonthlyIncome', 'PercentSalaryHike', 'StockOptionLevel', 'Salary',
       'StandardHours'],
      dtype='object')

In [125]:
df_limpio['EmployeeID'].isnull().sum()
df_nulos = df_limpio.loc[df_limpio['EmployeeID'].isnull(),:]

In [126]:
df_nulos.shape[0]

431

In [127]:
indices_pre = df_nulos.index

In [128]:
df_nulos.duplicated().sum()
df_nulos_duplicados = df_nulos.loc[df_nulos.duplicated(),:]

In [129]:
df_nulos = df_nulos.drop_duplicates(keep="last")

In [130]:
df_nulos.shape[0]

412

In [131]:
indices_post = df_nulos.index

In [132]:
print(indices_pre)
print(indices_post)

Int64Index([   3,    4,    8,   11,   12,   14,   17,   18,   19,   22,
            ...
            1577, 1584, 1588, 1596, 1599, 1601, 1602, 1607, 1611, 1613],
           dtype='int64', length=431)
Int64Index([   3,    4,    8,   11,   12,   14,   17,   18,   19,   22,
            ...
            1577, 1584, 1588, 1596, 1599, 1601, 1602, 1607, 1611, 1613],
           dtype='int64', length=412)

In [133]:
#lista_filas_borrar = []
4 in indices_pre

True

In [134]:
lista_borrar = [i for i in indices_pre if i not in indices_post]

In [135]:
len(lista_borrar)

19

In [136]:
df_limpio = df_limpio.drop(lista_borrar)

In [137]:
df_limpio.head(84)

,EmployeeID,Age,Gender,MaritalStatus,NumberChildren,DateBirth,Over18,Education,EducationField,NumCompaniesWorked,TotalWorkingYears,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager,EnvironmentSatisfaction,JobSatisfaction,RelationshipSatisfaction,WorkLifeBalance,JobInvolvement,PerformanceRating,Attrition,OverTime,DistanceFromHome,RemoteWork,BusinessTravel,TrainingTimesLastYear,Department,JobRole,JobLevel,DailyRate,HourlyRate,MonthlyRate,MonthlyIncome,PercentSalaryHike,StockOptionLevel,Salary,StandardHours
0,"162,0",51,Male,NaN,NaN,1972,Y,3,NaN,7,NaN,20,NaN,15,15,1,3,3,3.0,3,3.0,No,No,6,1,NaN,5,NaN,research director,5,684.0,51.0,6462.0,19537.0,13,0,1000000000,NaN
1,"259,0",52,Male,NaN,NaN,1971,NaN,4,Life Sciences,0,"34,0",33,NaN,11,9,1,3,1,3.0,2,3.0,No,NaN,1,1,NaN,5,NaN,manager,5,699.0,65.0,5678.0,19999.0,14,1,1000000000,NaN
2,"319,0",42,Male,Married,NaN,1981,NaN,2,Technical Degree,1,"22,0",22,NaN,11,15,1,4,4,NaN,3,3.0,No,No,4,1,travel_rarely,3,Research & Development,manager,5,532.0,58.0,4933.0,19232.0,11,0,1000000000,NaN
3,NaN,47,Female,Married,NaN,1976,Y,4,Medical,3,NaN,20,NaN,5,6,1,3,2,NaN,3,3.0,No,NaN,2,0,travel_rarely,2,NaN,research director,4,359.0,82.0,26703.0,17169.0,19,2,1000000000,NaN
4,NaN,46,Female,Divorced,NaN,1977,Y,3,Technical Degree,2,NaN,19,NaN,2,8,1,1,4,3.0,4,3.0,No,No,3,0,NaN,5,NaN,sales executive,4,1319.0,45.0,7739.0,NaN,12,1,1000000000,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
79,"131,0",58,Male,Single,NaN,1965,NaN,4,NaN,0,"38,0",37,NaN,1,8,1,3,3,2.0,3,3.0,No,NaN,18,1,travel_rarely,1,NaN,sales executive,4,682.0,37.0,24409.0,13872.0,13,0,1000000000,NaN
80,"153,0",34,Female,Single,NaN,1989,NaN,3,NaN,2,"14,0",11,NaN,5,8,1,1,4,3.0,2,3.0,No,NaN,5,0,travel_rarely,6,NaN,manager,3,1354.0,45.0,5615.0,NaN,12,0,1000000000,80.0
82,"307,0",38,Male,Divorced,NaN,1985,Y,3,Life Sciences,0,NaN,16,NaN,5,13,1,3,3,2.0,3,3.0,No,NaN,3,1,NaN,6,NaN,sales executive,3,119.0,76.0,9647.0,NaN,12,2,1000000000,NaN
84,"374,0",55,Male,Single,NaN,1968,Y,3,Medical,0,"37,0",36,NaN,4,13,1,1,3,3.0,3,3.0,No,NaN,1,1,travel_rarely,2,NaN,manager,5,452.0,81.0,18938.0,19045.0,14,0,1000000000,NaN
85,NaN,41,Male,NaN,NaN,1982,NaN,4,NaN,1,NaN,22,NaN,0,4,1,2,2,3.0,3,3.0,No,NaN,10,1,NaN,2,NaN,manager,4,334.0,88.0,15896.0,16015.0,19,0,1000000000,NaN

In [138]:
df_limpio = df_limpio.reset_index()

In [139]:
df_limpio.drop("index", axis=1, inplace=True)

In [140]:
df_limpio.head()

,EmployeeID,Age,Gender,MaritalStatus,NumberChildren,DateBirth,Over18,Education,EducationField,NumCompaniesWorked,TotalWorkingYears,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager,EnvironmentSatisfaction,JobSatisfaction,RelationshipSatisfaction,WorkLifeBalance,JobInvolvement,PerformanceRating,Attrition,OverTime,DistanceFromHome,RemoteWork,BusinessTravel,TrainingTimesLastYear,Department,JobRole,JobLevel,DailyRate,HourlyRate,MonthlyRate,MonthlyIncome,PercentSalaryHike,StockOptionLevel,Salary,StandardHours
0,"162,0",51,Male,NaN,NaN,1972,Y,3,NaN,7,NaN,20,NaN,15,15,1,3,3,3.0,3,3.0,No,No,6,1,NaN,5,NaN,research director,5,684.0,51.0,6462.0,19537.0,13,0,1000000000,NaN
1,"259,0",52,Male,NaN,NaN,1971,NaN,4,Life Sciences,0,"34,0",33,NaN,11,9,1,3,1,3.0,2,3.0,No,NaN,1,1,NaN,5,NaN,manager,5,699.0,65.0,5678.0,19999.0,14,1,1000000000,NaN
2,"319,0",42,Male,Married,NaN,1981,NaN,2,Technical Degree,1,"22,0",22,NaN,11,15,1,4,4,NaN,3,3.0,No,No,4,1,travel_rarely,3,Research & Development,manager,5,532.0,58.0,4933.0,19232.0,11,0,1000000000,NaN
3,NaN,47,Female,Married,NaN,1976,Y,4,Medical,3,NaN,20,NaN,5,6,1,3,2,NaN,3,3.0,No,NaN,2,0,travel_rarely,2,NaN,research director,4,359.0,82.0,26703.0,17169.0,19,2,1000000000,NaN
4,NaN,46,Female,Divorced,NaN,1977,Y,3,Technical Degree,2,NaN,19,NaN,2,8,1,1,4,3.0,4,3.0,No,No,3,0,NaN,5,NaN,sales executive,4,1319.0,45.0,7739.0,NaN,12,1,1000000000,NaN

In [141]:
df_limpio.shape

(1595, 38)

In [142]:
df_limpio = df_limpio.drop_duplicates(keep="first")

In [143]:
df_limpio.duplicated().sum()

0

In [144]:
df_limpio = df_limpio.reset_index()

In [145]:
df_limpio.drop("index", axis=1, inplace=True)

In [146]:
df_limpio.head()

,EmployeeID,Age,Gender,MaritalStatus,NumberChildren,DateBirth,Over18,Education,EducationField,NumCompaniesWorked,TotalWorkingYears,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager,EnvironmentSatisfaction,JobSatisfaction,RelationshipSatisfaction,WorkLifeBalance,JobInvolvement,PerformanceRating,Attrition,OverTime,DistanceFromHome,RemoteWork,BusinessTravel,TrainingTimesLastYear,Department,JobRole,JobLevel,DailyRate,HourlyRate,MonthlyRate,MonthlyIncome,PercentSalaryHike,StockOptionLevel,Salary,StandardHours
0,"162,0",51,Male,NaN,NaN,1972,Y,3,NaN,7,NaN,20,NaN,15,15,1,3,3,3.0,3,3.0,No,No,6,1,NaN,5,NaN,research director,5,684.0,51.0,6462.0,19537.0,13,0,1000000000,NaN
1,"259,0",52,Male,NaN,NaN,1971,NaN,4,Life Sciences,0,"34,0",33,NaN,11,9,1,3,1,3.0,2,3.0,No,NaN,1,1,NaN,5,NaN,manager,5,699.0,65.0,5678.0,19999.0,14,1,1000000000,NaN
2,"319,0",42,Male,Married,NaN,1981,NaN,2,Technical Degree,1,"22,0",22,NaN,11,15,1,4,4,NaN,3,3.0,No,No,4,1,travel_rarely,3,Research & Development,manager,5,532.0,58.0,4933.0,19232.0,11,0,1000000000,NaN
3,NaN,47,Female,Married,NaN,1976,Y,4,Medical,3,NaN,20,NaN,5,6,1,3,2,NaN,3,3.0,No,NaN,2,0,travel_rarely,2,NaN,research director,4,359.0,82.0,26703.0,17169.0,19,2,1000000000,NaN
4,NaN,46,Female,Divorced,NaN,1977,Y,3,Technical Degree,2,NaN,19,NaN,2,8,1,1,4,3.0,4,3.0,No,No,3,0,NaN,5,NaN,sales executive,4,1319.0,45.0,7739.0,NaN,12,1,1000000000,NaN

In [149]:
def poner_ids(dato):
    
    for i , valor in enumerate(dato):
        
        if valor == float('NaN'):
            
            return f'nan{i}'
        
        else:
            return valor

In [150]:
df_limpio["EmployeeID"]

0       162,0
1       259,0
2       319,0
3         NaN
4         NaN
        ...
1558      NaN
1559    966,0
1560    972,0
1561      NaN
1562      NaN
Name: EmployeeID, Length: 1563, dtype: object

In [152]:
df_limpio['EmployeeID']

0       162,0
1       259,0
2       319,0
3        nan0
4        nan0
        ...
1558     nan0
1559    966,0
1560    972,0
1561     nan0
1562     nan0
Name: EmployeeID, Length: 1563, dtype: object

In [155]:



def asignar_id(valor, contador):
    if pd.isnull(valor):
        contador += 1  # Incrementar el contador si el valor es NaN
        return f'nan{contador }'  # Devolver el ID con el contador actualizado
    else:
        return valor  # Devolver el valor sin cambios

# Definir el DataFrame df_limpio

# Inicializar el contador
contador = 0

# Aplicar la función a la columna EmployeeID
df_limpio['EmployeeID'] = df_limpio['EmployeeID'].apply(lambda x: asignar_id(x, contador))

In [156]:
df_limpio['EmployeeID']

0       162,0
1       259,0
2       319,0
3        nan0
4        nan0
        ...
1558     nan0
1559    966,0
1560    972,0
1561     nan0
1562     nan0
Name: EmployeeID, Length: 1563, dtype: object